In [14]:
import pyodbc
from sqlalchemy import create_engine
import pandas as pd

In [126]:
# create engine
engine = create_engine('mssql+pyodbc://localhost\\SQLEXPRESS/music?driver=SQL Server?Trusted_Connection=yes')

In [29]:
# show databases
pd.read_sql_query('select name from sys.databases', con=engine)

      name
0   master
1   tempdb
2    model
3     msdb
4    music
5  company

In [4]:
engine.execute('CREATE DATABASE company')

In [30]:
engine.execute('use company')

In [69]:
# create table members 
engine.execute("\
CREATE TABLE members (\
    Member_ID INT IDENTITY(100,1) PRIMARY KEY,\
    First_Name VARCHAR(50) NOT NULL,\
    Last_Name VARCHAR(50) NOT NULL,\
    Date_Of_Birth VARCHAR(10) NOT NULL,\
    Address VARCHAR(50) NOT NULL,\
    City VARCHAR(30) NOT NULL,\
    State VARCHAR(2) NOT NULL,\
    ZIP_Code INT NOT NULL,\
    Plan_Type VARCHAR(20) NOT NULL\
);")

In [67]:
# create dataframe 
members = pd.read_csv('members.csv', index_col=[0])

In [68]:
members.head()

,First_Name,Last_Name,Date_Of_Birth,Address,City,State,ZIP_Code,Plan_Type
0,BERNIE,BARRERA,03/29/1944,571 Columbia Ct,Commodore,PA,19104,Silver Star
1,DORIAN,SALAZAR,03/28/1970,4 Madison Rd,HBG,PA,19187,Silver Star
2,VALENTIN,JARVIS,03/22/1994,903 West Blvd,Meadville,PA,16820,Platinum Star
3,ARIEL,MONTES,09/29/1938,221 Round Cir,Slateville,PA,16922,Platinum Star
4,ADOLPH,POOLE,09/21/1996,594 Hillsboro St,Houtzdale,PA,17301,Silver Star

In [37]:
int(members['Date_Of_Birth'][0][-4:])

1944

In [70]:
# write data frame to SQL
members.to_sql('members', con=engine, if_exists='append', index=False)

In [71]:
pd.read_sql_query('select * from members', con=engine)

,Member_ID,First_Name,Last_Name,Date_Of_Birth,Address,City,State,ZIP_Code,Plan_Type
0,100,BERNIE,BARRERA,03/29/1944,571 Columbia Ct,Commodore,PA,19104,Silver Star
1,101,DORIAN,SALAZAR,03/28/1970,4 Madison Rd,HBG,PA,19187,Silver Star
2,102,VALENTIN,JARVIS,03/22/1994,903 West Blvd,Meadville,PA,16820,Platinum Star
3,103,ARIEL,MONTES,09/29/1938,221 Round Cir,Slateville,PA,16922,Platinum Star
4,104,ADOLPH,POOLE,09/21/1996,594 Hillsboro St,Houtzdale,PA,17301,Silver Star
...,...,...,...,...,...,...,...,...,...
95,195,DONNELL,SIMMONS,05/11/1986,594 Havelock Rd,Duquesne,PA,17059,Gold Star
96,196,DEANDRE,SWANSON,09/20/1994,989 Newport Rd,Northpoint,PA,18403,Silver Star
97,197,ABE,QUINTERO,09/21/1988,253 Stillwater Cir,Sereno,PA,19420,Gold Star
98,198,ELISEO,WILKINS,02/04/2009,191 Northbrook St,Philadelphia,PA,15615,Platinum Star
99,199,DERICK,WALLER,06/24/1983,674 Barberton Cir,Weidmanville,PA,19003,Gold Star

In [128]:
engine.dispose()